grevaillot/svd_tools/headers/ATSAM4S4C/pwm.h
/** PWM_OSS_OSSL3 Output Selection Set for PWML output of the channel 3 **/
#define PWM_OSS_OSSL3		(1 << 19)
/** PWM_OSS_OSSL2 Output Selection Set for PWML output of the channel 2 **/
#define PWM_OSS_OSSL2		(1 << 18)
/** PWM_OSS_OSSL1 Output Selection Set for PWML output of the channel 1 **/
#define PWM_OSS_OSSL1		(1 << 17)
/** PWM_OSS_OSSL0 Output Selection Set for PWML output of the channel 0 **/
#define PWM_OSS_OSSL0		(1 << 16)
/** PWM_OSS_OSSH3 Output Selection Set for PWMH output of the channel 3 **/
#define PWM_OSS_OSSH3		(1 << 3)
/** PWM_OSS_OSSH2 Output Selection Set for PWMH output of the channel 2 **/
#define PWM_OSS_OSSH2		(1 << 2)
/** PWM_OSS_OSSH1 Output Selection Set for PWMH output of the channel 1 **/
#define PWM_OSS_OSSH1		(1 << 1)
/** PWM_OSS_OSSH0 Output Selection Set for PWMH output of the channel 0 **/
#define PWM_OSS_OSSH0		(1 << 0)

/**@}*/

/** @defgroup pwm_osc OSC PWM Output Selection Clear Register
@{*/

/** PWM_OSC_OSCL3 Output Selection Clear for PWML output of the channel 3 **/
#define PWM_OSC_OSCL3		(1 << 19)
/** PWM_OSC_OSCL2 Output Selection Clear for PWML output of the channel 2 **/
#define PWM_OSC_OSCL2		(1 << 18)
/** PWM_OSC_OSCL1 Output Selection Clear for PWML output of the channel 1 **/
#define PWM_OSC_OSCL1		(1 << 17)
/** PWM_OSC_OSCL0 Output Selection Clear for PWML output of the channel 0 **/
#define PWM_OSC_OSCL0		(1 << 16)
/** PWM_OSC_OSCH3 Output Selection Clear for PWMH output of the channel 3 **/
#define PWM_OSC_OSCH3		(1 << 3)
/** PWM_OSC_OSCH2 Output Selection Clear for PWMH output of the channel 2 **/
#define PWM_OSC_OSCH2		(1 << 2)
/** PWM_OSC_OSCH1 Output Selection Clear for PWMH output of the channel 1 **/
#define PWM_OSC_OSCH1		(1 << 1)
/** PWM_OSC_OSCH0 Output Selection Clear for PWMH output of the channel 0 **/
#define PWM_OSC_OSCH0		(1 << 0)

/**@}*/

/** @defgroup pwm_ossupd OSSUPD PWM Output Selection Set Update Register
@{*/

/** PWM_OSSUPD_OSSUPL3 Output Selection Set for PWML output of the channel 3 **/
#define PWM_OSSUPD_OSSUPL3		(1 << 19)
/** PWM_OSSUPD_OSSUPL2 Output Selection Set for PWML output of the channel 2 **/
#define PWM_OSSUPD_OSSUPL2		(1 << 18)
/** PWM_OSSUPD_OSSUPL1 Output Selection Set for PWML output of the channel 1 **/
#define PWM_OSSUPD_OSSUPL1		(1 << 17)
/** PWM_OSSUPD_OSSUPL0 Output Selection Set for PWML output of the channel 0 **/
#define PWM_OSSUPD_OSSUPL0		(1 << 16)
/** PWM_OSSUPD_OSSUPH3 Output Selection Set for PWMH output of the channel 3 **/
#define PWM_OSSUPD_OSSUPH3		(1 << 3)
/** PWM_OSSUPD_OSSUPH2 Output Selection Set for PWMH output of the channel 2 **/
#define PWM_OSSUPD_OSSUPH2		(1 << 2)
/** PWM_OSSUPD_OSSUPH1 Output Selection Set for PWMH output of the channel 1 **/
#define PWM_OSSUPD_OSSUPH1		(1 << 1)
/** PWM_OSSUPD_OSSUPH0 Output Selection Set for PWMH output of the channel 0 **/
#define PWM_OSSUPD_OSSUPH0		(1 << 0)

/**@}*/

/** @defgroup pwm_oscupd OSCUPD PWM Output Selection Clear Update Register
@{*/

/** PWM_OSCUPD_OSCUPL3 Output Selection Clear for PWML output of the channel 3 **/
#define PWM_OSCUPD_OSCUPL3		(1 << 19)
/** PWM_OSCUPD_OSCUPL2 Output Selection Clear for PWML output of the channel 2 **/
#define PWM_OSCUPD_OSCUPL2		(1 << 18)
/** PWM_OSCUPD_OSCUPL1 Output Selection Clear for PWML output of the channel 1 **/
#define PWM_OSCUPD_OSCUPL1		(1 << 17)
/** PWM_OSCUPD_OSCUPL0 Output Selection Clear for PWML output of the channel 0 **/
#define PWM_OSCUPD_OSCUPL0		(1 << 16)
/** PWM_OSCUPD_OSCUPH3 Output Selection Clear for PWMH output of the channel 3 **/
#define PWM_OSCUPD_OSCUPH3		(1 << 3)
/** PWM_OSCUPD_OSCUPH2 Output Selection Clear for PWMH output of the channel 2 **/
#define PWM_OSCUPD_OSCUPH2		(1 << 2)
/** PWM_OSCUPD_OSCUPH1 Output Selection Clear for PWMH output of the channel 1 **/
#define PWM_OSCUPD_OSCUPH1		(1 << 1)
/** PWM_OSCUPD_OSCUPH0 Output Selection Clear for PWMH output of the channel 0 **/
#define PWM_OSCUPD_OSCUPH0		(1 << 0)

/**@}*/

/** @defgroup pwm_fmr FMR PWM Fault Mode Register
@{*/


#define PWM_FMR_FFIL_SHIFT		16
#define PWM_FMR_FFIL_MASK		0xff
/** @defgroup pwm_fmr_ffil FFIL Fault Filtering
@{*/
/**@}*/


#define PWM_FMR_FMOD_SHIFT		8
#define PWM_FMR_FMOD_MASK		0xff
/** @defgroup pwm_fmr_fmod FMOD Fault Activation Mode
@{*/
/**@}*/


#define PWM_FMR_FPOL_SHIFT		0
#define PWM_FMR_FPOL_MASK		0xff
/** @defgroup pwm_fmr_fpol FPOL Fault Polarity
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_fsr FSR PWM Fault Status Register
@{*/


#define PWM_FSR_FS_SHIFT		8
#define PWM_FSR_FS_MASK		0xff
/** @defgroup pwm_fsr_fs FS Fault Status
@{*/
/**@}*/


#define PWM_FSR_FIV_SHIFT		0
#define PWM_FSR_FIV_MASK		0xff
/** @defgroup pwm_fsr_fiv FIV Fault Input Value
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_fcr FCR PWM Fault Clear Register
@{*/


#define PWM_FCR_FCLR_SHIFT		0
#define PWM_FCR_FCLR_MASK		0xff
/** @defgroup pwm_fcr_fclr FCLR Fault Clear
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_fpv FPV PWM Fault Protection Value Register
@{*/

/** PWM_FPV_FPVL3 Fault Protection Value for PWML output on channel 3 **/
#define PWM_FPV_FPVL3		(1 << 19)
/** PWM_FPV_FPVL2 Fault Protection Value for PWML output on channel 2 **/
#define PWM_FPV_FPVL2		(1 << 18)
/** PWM_FPV_FPVL1 Fault Protection Value for PWML output on channel 1 **/
#define PWM_FPV_FPVL1		(1 << 17)
/** PWM_FPV_FPVL0 Fault Protection Value for PWML output on channel 0 **/
#define PWM_FPV_FPVL0		(1 << 16)
/** PWM_FPV_FPVH3 Fault Protection Value for PWMH output on channel 3 **/
#define PWM_FPV_FPVH3		(1 << 3)
/** PWM_FPV_FPVH2 Fault Protection Value for PWMH output on channel 2 **/
#define PWM_FPV_FPVH2		(1 << 2)
/** PWM_FPV_FPVH1 Fault Protection Value for PWMH output on channel 1 **/
#define PWM_FPV_FPVH1		(1 << 1)
/** PWM_FPV_FPVH0 Fault Protection Value for PWMH output on channel 0 **/
#define PWM_FPV_FPVH0		(1 << 0)

/**@}*/

/** @defgroup pwm_fpe FPE PWM Fault Protection Enable Register
@{*/


#define PWM_FPE_FPE3_SHIFT		24
#define PWM_FPE_FPE3_MASK		0xff
/** @defgroup pwm_fpe_fpe3 FPE3 Fault Protection Enable for channel 3
@{*/
/**@}*/


#define PWM_FPE_FPE2_SHIFT		16
#define PWM_FPE_FPE2_MASK		0xff
/** @defgroup pwm_fpe_fpe2 FPE2 Fault Protection Enable for channel 2
@{*/
/**@}*/


#define PWM_FPE_FPE1_SHIFT		8
#define PWM_FPE_FPE1_MASK		0xff
/** @defgroup pwm_fpe_fpe1 FPE1 Fault Protection Enable for channel 1
@{*/
/**@}*/


#define PWM_FPE_FPE0_SHIFT		0
#define PWM_FPE_FPE0_MASK		0xff
/** @defgroup pwm_fpe_fpe0 FPE0 Fault Protection Enable for channel 0
@{*/
/**@}*/


/**@}*/

