grevaillot/svd_tools/headers/ATSAM4S4C/pwm.h
#define PWM_CMPMUPD3_CUPRUPD_SHIFT		16
#define PWM_CMPMUPD3_CUPRUPD_MASK		0x0f
/** @defgroup pwm_cmpmupd3_cuprupd CUPRUPD Comparison x Update Period Update
@{*/
/**@}*/


#define PWM_CMPMUPD3_CPRUPD_SHIFT		8
#define PWM_CMPMUPD3_CPRUPD_MASK		0x0f
/** @defgroup pwm_cmpmupd3_cprupd CPRUPD Comparison x Period Update
@{*/
/**@}*/


#define PWM_CMPMUPD3_CTRUPD_SHIFT		4
#define PWM_CMPMUPD3_CTRUPD_MASK		0x0f
/** @defgroup pwm_cmpmupd3_ctrupd CTRUPD Comparison x Trigger Update
@{*/
/**@}*/

/** PWM_CMPMUPD3_CENUPD Comparison x Enable Update **/
#define PWM_CMPMUPD3_CENUPD		(1 << 0)

/**@}*/

/** @defgroup pwm_cmpv4 CMPV4 PWM Comparison 4 Value Register
@{*/

/** PWM_CMPV4_CVM Comparison x Value Mode **/
#define PWM_CMPV4_CVM		(1 << 24)

#define PWM_CMPV4_CV_SHIFT		0
#define PWM_CMPV4_CV_MASK		0xffffff
/** @defgroup pwm_cmpv4_cv CV Comparison x Value
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_cmpvupd4 CMPVUPD4 PWM Comparison 4 Value Update Register
@{*/

/** PWM_CMPVUPD4_CVMUPD Comparison x Value Mode Update **/
#define PWM_CMPVUPD4_CVMUPD		(1 << 24)

#define PWM_CMPVUPD4_CVUPD_SHIFT		0
#define PWM_CMPVUPD4_CVUPD_MASK		0xffffff
/** @defgroup pwm_cmpvupd4_cvupd CVUPD Comparison x Value Update
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_cmpm4 CMPM4 PWM Comparison 4 Mode Register
@{*/


#define PWM_CMPM4_CUPRCNT_SHIFT		20
#define PWM_CMPM4_CUPRCNT_MASK		0x0f
/** @defgroup pwm_cmpm4_cuprcnt CUPRCNT Comparison x Update Period Counter
@{*/
/**@}*/


#define PWM_CMPM4_CUPR_SHIFT		16
#define PWM_CMPM4_CUPR_MASK		0x0f
/** @defgroup pwm_cmpm4_cupr CUPR Comparison x Update Period
@{*/
/**@}*/


#define PWM_CMPM4_CPRCNT_SHIFT		12
#define PWM_CMPM4_CPRCNT_MASK		0x0f
/** @defgroup pwm_cmpm4_cprcnt CPRCNT Comparison x Period Counter
@{*/
/**@}*/


#define PWM_CMPM4_CPR_SHIFT		8
#define PWM_CMPM4_CPR_MASK		0x0f
/** @defgroup pwm_cmpm4_cpr CPR Comparison x Period
@{*/
/**@}*/


#define PWM_CMPM4_CTR_SHIFT		4
#define PWM_CMPM4_CTR_MASK		0x0f
/** @defgroup pwm_cmpm4_ctr CTR Comparison x Trigger
@{*/
/**@}*/

/** PWM_CMPM4_CEN Comparison x Enable **/
#define PWM_CMPM4_CEN		(1 << 0)

/**@}*/

/** @defgroup pwm_cmpmupd4 CMPMUPD4 PWM Comparison 4 Mode Update Register
@{*/


#define PWM_CMPMUPD4_CUPRUPD_SHIFT		16
#define PWM_CMPMUPD4_CUPRUPD_MASK		0x0f
/** @defgroup pwm_cmpmupd4_cuprupd CUPRUPD Comparison x Update Period Update
@{*/
/**@}*/


#define PWM_CMPMUPD4_CPRUPD_SHIFT		8
#define PWM_CMPMUPD4_CPRUPD_MASK		0x0f
/** @defgroup pwm_cmpmupd4_cprupd CPRUPD Comparison x Period Update
@{*/
/**@}*/


#define PWM_CMPMUPD4_CTRUPD_SHIFT		4
#define PWM_CMPMUPD4_CTRUPD_MASK		0x0f
/** @defgroup pwm_cmpmupd4_ctrupd CTRUPD Comparison x Trigger Update
@{*/
/**@}*/

/** PWM_CMPMUPD4_CENUPD Comparison x Enable Update **/
#define PWM_CMPMUPD4_CENUPD		(1 << 0)

/**@}*/

/** @defgroup pwm_cmpv5 CMPV5 PWM Comparison 5 Value Register
@{*/

/** PWM_CMPV5_CVM Comparison x Value Mode **/
#define PWM_CMPV5_CVM		(1 << 24)

#define PWM_CMPV5_CV_SHIFT		0
#define PWM_CMPV5_CV_MASK		0xffffff
/** @defgroup pwm_cmpv5_cv CV Comparison x Value
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_cmpvupd5 CMPVUPD5 PWM Comparison 5 Value Update Register
@{*/

/** PWM_CMPVUPD5_CVMUPD Comparison x Value Mode Update **/
#define PWM_CMPVUPD5_CVMUPD		(1 << 24)

#define PWM_CMPVUPD5_CVUPD_SHIFT		0
#define PWM_CMPVUPD5_CVUPD_MASK		0xffffff
/** @defgroup pwm_cmpvupd5_cvupd CVUPD Comparison x Value Update
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_cmpm5 CMPM5 PWM Comparison 5 Mode Register
@{*/


#define PWM_CMPM5_CUPRCNT_SHIFT		20
#define PWM_CMPM5_CUPRCNT_MASK		0x0f
/** @defgroup pwm_cmpm5_cuprcnt CUPRCNT Comparison x Update Period Counter
@{*/
/**@}*/


#define PWM_CMPM5_CUPR_SHIFT		16
#define PWM_CMPM5_CUPR_MASK		0x0f
/** @defgroup pwm_cmpm5_cupr CUPR Comparison x Update Period
@{*/
/**@}*/


#define PWM_CMPM5_CPRCNT_SHIFT		12
#define PWM_CMPM5_CPRCNT_MASK		0x0f
/** @defgroup pwm_cmpm5_cprcnt CPRCNT Comparison x Period Counter
@{*/
/**@}*/


#define PWM_CMPM5_CPR_SHIFT		8
#define PWM_CMPM5_CPR_MASK		0x0f
/** @defgroup pwm_cmpm5_cpr CPR Comparison x Period
@{*/
/**@}*/


#define PWM_CMPM5_CTR_SHIFT		4
#define PWM_CMPM5_CTR_MASK		0x0f
/** @defgroup pwm_cmpm5_ctr CTR Comparison x Trigger
@{*/
/**@}*/

/** PWM_CMPM5_CEN Comparison x Enable **/
#define PWM_CMPM5_CEN		(1 << 0)

/**@}*/

/** @defgroup pwm_cmpmupd5 CMPMUPD5 PWM Comparison 5 Mode Update Register
@{*/


#define PWM_CMPMUPD5_CUPRUPD_SHIFT		16
#define PWM_CMPMUPD5_CUPRUPD_MASK		0x0f
/** @defgroup pwm_cmpmupd5_cuprupd CUPRUPD Comparison x Update Period Update
@{*/
/**@}*/


#define PWM_CMPMUPD5_CPRUPD_SHIFT		8
#define PWM_CMPMUPD5_CPRUPD_MASK		0x0f
/** @defgroup pwm_cmpmupd5_cprupd CPRUPD Comparison x Period Update
@{*/
/**@}*/


#define PWM_CMPMUPD5_CTRUPD_SHIFT		4
#define PWM_CMPMUPD5_CTRUPD_MASK		0x0f
/** @defgroup pwm_cmpmupd5_ctrupd CTRUPD Comparison x Trigger Update
@{*/
/**@}*/

/** PWM_CMPMUPD5_CENUPD Comparison x Enable Update **/
#define PWM_CMPMUPD5_CENUPD		(1 << 0)

/**@}*/

/** @defgroup pwm_cmpv6 CMPV6 PWM Comparison 6 Value Register
@{*/

/** PWM_CMPV6_CVM Comparison x Value Mode **/
#define PWM_CMPV6_CVM		(1 << 24)

#define PWM_CMPV6_CV_SHIFT		0
#define PWM_CMPV6_CV_MASK		0xffffff
/** @defgroup pwm_cmpv6_cv CV Comparison x Value
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_cmpvupd6 CMPVUPD6 PWM Comparison 6 Value Update Register
@{*/

/** PWM_CMPVUPD6_CVMUPD Comparison x Value Mode Update **/
#define PWM_CMPVUPD6_CVMUPD		(1 << 24)

#define PWM_CMPVUPD6_CVUPD_SHIFT		0
#define PWM_CMPVUPD6_CVUPD_MASK		0xffffff
/** @defgroup pwm_cmpvupd6_cvupd CVUPD Comparison x Value Update
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_cmpm6 CMPM6 PWM Comparison 6 Mode Register
@{*/


#define PWM_CMPM6_CUPRCNT_SHIFT		20
#define PWM_CMPM6_CUPRCNT_MASK		0x0f
/** @defgroup pwm_cmpm6_cuprcnt CUPRCNT Comparison x Update Period Counter
@{*/
/**@}*/


#define PWM_CMPM6_CUPR_SHIFT		16
#define PWM_CMPM6_CUPR_MASK		0x0f
/** @defgroup pwm_cmpm6_cupr CUPR Comparison x Update Period
@{*/
/**@}*/


#define PWM_CMPM6_CPRCNT_SHIFT		12
#define PWM_CMPM6_CPRCNT_MASK		0x0f
/** @defgroup pwm_cmpm6_cprcnt CPRCNT Comparison x Period Counter
@{*/
/**@}*/


#define PWM_CMPM6_CPR_SHIFT		8
#define PWM_CMPM6_CPR_MASK		0x0f
/** @defgroup pwm_cmpm6_cpr CPR Comparison x Period
@{*/
/**@}*/


